
nc: 3
backbone:
  - [-1, 1, TimmBackbone, ['swin_small_patch4_window7_224']]
head:
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 1], 1, Concat, [1]]
  - [-1, 1, C2f, [896, 256, 1, False]]

  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 0], 1, Concat, [1]]
  - [-1, 1, C2f, [448, 128, 1, False]]

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 1, C2f, [384, 256, 1]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 1, C2f, [768, 512, 1]]
  - [-1, 1, SPPF, [512, 512]]

  - [[8, 11, 14], 1, Detect, [3]]
